---
kind: method
id: M:Autodesk.Revit.DB.FamilySizeTableManager.GetSizeTable(System.String)
source: html/e2fb9f86-e444-67b6-c830-4037206636b4.htm
---
# Autodesk.Revit.DB.FamilySizeTableManager.GetSizeTable Method

Get a FamilySizeTable by name.

## Syntax (C#)
```csharp
public FamilySizeTable GetSizeTable(
	string tableName
)
```

## Parameters
- **tableName** (`System.String`) - The FamilySizeTable name.

## Returns
The FamilySizeTable of a given name.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null